{"classes":["TECHNOLOGY"],"annotations":[["Apple on Thursday unveiled changes to iPhones designed to catch cases of child sexual abuse, a move that is likely to please parents and the police but that was already worrying privacy watchdogs.",{"entities":[[38,45,"TECHNOLOGY"]]}],["Later this year, iPhones will begin using complex technology to spot images of child sexual abuse, commonly known as child pornography, that users upload to Apple’s iCloud storage service, the company said.",{"entities":[[17,24,"TECHNOLOGY"],[50,97,"TECHNOLOGY"],[157,187,"TECHNOLOGY"]]}],["Apple also said it would soon let parents turn on a feature that can flag when their children send or receive any nude photos in a text message.",{"entities":[[52,143,"TECHNOLOGY"]]}],["Other cybersecurity experts were still concerned.",{"entities":[]}],["Matthew D. Green, a cryptography professor at Johns Hopkins University, said Apple’s new features set a dangerous precedent by creating surveillance technology that law enforcement or governments could exploit.",{"entities":[[77,97,"TECHNOLOGY"],[136,159,"TECHNOLOGY"]]}],["When New York City announced on Tuesday that it would soon require people to show proof of at least one coronavirus vaccine shot to enter businesses, Mayor Bill de Blasio said the system was “simple — just show it and you’re in.”",{"entities":[[104,123,"TECHNOLOGY"]]}],["Less simple was the privacy debate that the city reignited.",{"entities":[]}],["Vaccine passports, which show proof of vaccination, often in electronic form such as an app, are the bedrock of Mr. de Blasio’s plan.",{"entities":[[0,17,"TECHNOLOGY"],[88,91,"TECHNOLOGY"]]}],["For months, these records — also known as health passes or digital health certificates — have been under discussion around the world as a tool to allow vaccinated people, who are less at risk from the virus, to gather safely.",{"entities":[[42,55,"TECHNOLOGY"],[59,86,"TECHNOLOGY"],[138,224,"TECHNOLOGY"]]}],["New York will be the first U.S. city to include these passes in a vaccine mandate, potentially setting off similar actions elsewhere.",{"entities":[[54,60,"TECHNOLOGY"]]}],["This question will sound ridiculous, but it isn’t: Is YouTube a success?",{"entities":[]}],["Please hold your boos.",{"entities":[]}],["It’s hard to imagine the internet without YouTube.",{"entities":[[21,33,"TECHNOLOGY"]]}],["Buying the video site in its relative infancy was one of the smartest things Google ever did.",{"entities":[]}],["But after nearly 15 years of being part of Google, the most successful money machine in internet history, it’s still not clear that YouTube has fulfilled its financial potential both for itself and everyone involved in its vast digital economy.",{"entities":[]}],["Hate a messy smartphone?",{"entities":[[13,23,"TECHNOLOGY"]]}],["Recent versions of the Android and iOS operating systems give you plenty of ways to customize your home screen.",{"entities":[[19,56,"TECHNOLOGY"],[99,110,"TECHNOLOGY"]]}],["Is your phone’s home screen jampacked with pages of apps in random order — including some apps you never use?",{"entities":[[8,27,"TECHNOLOGY"],[52,56,"TECHNOLOGY"],[90,94,"TECHNOLOGY"]]}],["Sure, you can always find the program you need with search or the voice assistant, or by browsing the app drawer.",{"entities":[[62,81,"TECHNOLOGY"],[98,112,"TECHNOLOGY"]]}],["But app access can be quicker if you have your icons arranged in a useful order and you take advantage of shortcut menus and widgets.",{"entities":[[106,120,"TECHNOLOGY"],[125,132,"TECHNOLOGY"]]}],["Here’s a guide to streamlining your home screen.",{"entities":[[36,47,"TECHNOLOGY"]]}],["A simple machine is a mechanical device that changes the direction or magnitude of a force. [2] In general, they can be defined as the simplest mechanisms that use mechanical advantage (also called leverage) to multiply force.",{"entities":[[2,16,"TECHNOLOGY"],[20,91,"TECHNOLOGY"],[143,224,"TECHNOLOGY"]]}],["The Space Race brought pioneering launches of artificial satellites, robotic space probes to the Moon, Venus, and Mars, and human spaceflight in low Earth orbit and ultimately to the Moon.",{"entities":[[46,67,"TECHNOLOGY"],[69,89,"TECHNOLOGY"],[124,141,"TECHNOLOGY"]]}],["A cotton gin – meaning \" cotton engine \" – is a machine that quickly and easily separates cotton fibers from their seeds, enabling much greater productivity than manual cotton separation.",{"entities":[[2,12,"TECHNOLOGY"],[31,37,"TECHNOLOGY"],[44,118,"TECHNOLOGY"]]}],["A telephone is a telecommunications device that permits two or more users to conduct a conversation when they are too far apart to be heard directly.",{"entities":[[2,11,"TECHNOLOGY"],[15,148,"TECHNOLOGY"]]}],["The essential elements of a telephone are a microphone (transmitter) to speak into and an earphone (receiver) which reproduces the voice in a distant location.",{"entities":[[28,37,"TECHNOLOGY"],[44,54,"TECHNOLOGY"],[56,67,"TECHNOLOGY"],[90,98,"TECHNOLOGY"],[100,108,"TECHNOLOGY"]]}]]}